recipes/lentil-+-vegan-ricotta-lasagna.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lentil + vegan ricotta lasagna</title>
<meta name="author" content="james" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Lentil + vegan ricotta lasagna</h1>
<p>
[[<a href="https://www.noracooks.com/best-vegan-lasagna/">https://www.noracooks.com/best-vegan-lasagna/</a>][Original link]
</p>

<div id="outline-container-org0e78c59" class="outline-2">
<h2 id="org0e78c59">Ingredients</h2>
<div class="outline-text-2" id="text-org0e78c59">
<ul class="org-ul">
<li>1 cup dried red lentils</li>
<li>2x700 g passata</li>
<li>1 cup raw cashews</li>
<li>400 g firm tofu patted dry</li>
<li>1/2 cup nutritional yeast</li>
<li>3 tbsp fresh lemon juice from about 2 lemons</li>
<li>1 tsp salt</li>
<li>1 tsp dried basil</li>
<li>1 tsp oregano</li>
<li>1/2 tsp garlic powder</li>
<li>3 cups baby spinach</li>
<li>1 box lasagna noodles (about 12 noodles)</li>
<li>(Optional) Vegan Mozzarella Cheese for topping</li>
</ul>
</div>
</div>

<div id="outline-container-orgb01e2c8" class="outline-2">
<h2 id="orgb01e2c8">Instructions</h2>
<div class="outline-text-2" id="text-orgb01e2c8">
<ol class="org-ol">
<li><b>Cook the red lentils</b>. Add 1 cup dried red lentils and 3 cups of water to a medium pot. Bring to a boil, and then simmer for about 20 minutes. Drain the lentils in a fine strainer, and then add back to the pot and stir in the marinara sauce. Set aside.</li>
<li>Preheat the oven to 180&deg;C.</li>
<li><b>Make the Cashew-Tofu Ricotta</b>. Add the cashews to a food processor and process until fine and crumbly. Then add the tofu in chunks, nutritional yeast, lemon juice, salt, basil, oregano and garlic powder to the food processor. Pulse until well combined and pretty smooth. If it's too thick, add a few tablespoons of water to blend. Set aside.</li>
<li><b>Assembling the lasagna</b>. Add about 1 cup of lentil marinara to the bottom of a large casserole dish. Spread it around evenly. Next add 4-5 lasagna noodles (uncooked). Spread half of the ricotta on top of the noodles. Top with half of the spinach. Add about 1 cup of the marinara sauce over the spinach, then place 4-5 lasagna noodles on top. Spread the rest of the ricotta over the noodles, then the rest of the spinach. Place 4-5 more noodles on top of the spinach, and then pour the rest of the sauce over the top, evenly.</li>
<li>Cover tightly with foil and bake for 40 minutes.</li>
<li>After 40 minutes, remove the foil and spoon on the mozzarella (or sprinkle the cheese all over). Place the lasagna back in the oven and bake for 20 more minutes, uncovered. Remove from oven, let cool for at least 15 minutes and serve. Leftover lasagna will keep for about 4 days in the refrigerator. See notes for freezing instructions.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
